Blog/app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
      <p><%= post.body %></p>
      <p>Comments: <%= post.comments.length %></p>