Blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---

	<h4>Comments (<%= @post.comments.length %>)</h4>