Blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :asc)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" ASC

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "kek"], ["body", "lol"], ["created_at", "2015-12-30 14:08:39.643808"], ["updated_at", "2015-12-30 14:08:39.643808"]]